# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [16]:

import pandas as pd

df=pd.read_csv("Grades.csv", header=0)

df.head()

#df_data = pd.read_csv("Purchase_Data.csv", header=0)
#print(df_data.head())

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32.0,1,19.5,20.0,1,10.0,33.0,A
1,Joe,32.0,1,20.0,16.0,1,14.0,32.0,A
2,Susan,30.0,1,19.0,19.0,1,10.5,33.0,A-
3,Sol,31.0,1,22.0,13.0,1,13.0,34.0,A
4,Chris,30.0,1,19.0,17.0,1,12.5,33.5,A

Use the dtypes attribute to view how each column is stored

In [17]:
df_data["invoice_number"].dtypes

dtype('float64')

print(df_data.dtypes)

In [ ]:
df_data.dtypes.head()
print(df_data.dtypes)

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two rows using .loc and store the result in a variable called result_2.

In [28]:
result_2 = df_data.loc[0:1, :]
result_2.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [26]:
result_3 = df_data.iloc[:4, :5]
result_3.head()

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [30]:
result_4 = df_data.loc[[0, 4, 6], ["invoice_time", "price"]]
result_4.head()

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [32]:
num_rows = len(df_data)
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [35]:
last_row = df_data.iloc[num_rows-1:num_rows]  
last_row.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [39]:
avg_price = df_data["price"].mean()
max_price = df_data["price"].max()

print("avg_price:", avg_price)
print("max_price:", max_price)
#ref recheck
#avg_price = df_data["price"].mean()
#avg_price

avg_price: 3.1920522110741363
max_price: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [40]:
means = df_data[["price", "num_item"]].mean()
avg_price = means["price"]
avg_num_items = means["num_item"]

print("avg_price:", avg_price)
print("avg_num_items:", avg_num_items)

avg_price: 3.1920522110741363
avg_num_items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [43]:
df_data["total"] = df_data["price"] * df_data["num_item"]
#print(df_data[["price", "num_item", "total"]].head())
df_data[["price", "num_item", "total"]].head()

   price  num_item  total
0    2.0       1.0    2.0
1    2.0       1.0    2.0
2    2.0       1.0    2.0
3    6.0       1.0    6.0
4    6.0       1.0    6.0

What is the avgerage price of the three most expensive purchases?

In [46]:
avg_top3 = df_data["price"].nlargest(3).mean()
print("avg_price_top3:", avg_top3)

avg_price_top3: 6.003333333333333

How many different products are there?

In [ ]:
#Write your code here
df_data["product_id"].nunique()

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [ ]:
desc = df_data["total"].describe()
diff_total = desc["mean"] - desc["50%"]
print("mean - median (total):", diff_total)

mean - median (total): 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [47]:
df_data.drop(columns="total", inplace=True)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [ ]:
#nothing to write here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [52]:
df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])
print(df_data.dtypes)
df_data["invoice_time"].head()

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
DOW                       object
Month                      int32
dtype: object

0   2015-07-15 10:45:00
1   2015-07-15 12:16:00
2   2015-07-15 12:16:00
3   2015-07-15 12:16:00
4   2015-07-15 12:16:00
Name: invoice_time, dtype: datetime64[ns]

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [ ]:
df_data["DOW"] = df_data["invoice_time"].dt.day_name()
df_data["Month"] = df_data["invoice_time"].dt.month
df_data[["invoice_time", "DOW", "Month"]].head()

         invoice_time        DOW  Month
0 2015-07-15 10:45:00  Wednesday      7
1 2015-07-15 12:16:00  Wednesday      7
2 2015-07-15 12:16:00  Wednesday      7
3 2015-07-15 12:16:00  Wednesday      7
4 2015-07-15 12:16:00  Wednesday      7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [53]:
num_purchases_wed = df_data["DOW"].value_counts()["Wednesday"]
print("num_purchases_wed:", num_purchases_wed)

num_purchases_wed: 959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [6]:
#Improt titanic.csv next box
from pathlib import Path
base = Path(r"c:\Users\User\Desktop\lab_assignment")

candidates = [
    "titanic.csv", "titanic_data.csv", "Titanic.csv",
    "train.csv", "titanic_train.csv"
]

for fname in candidates:
    p = base / fname
    if p.exists():
        df_titanic = pd.read_csv(p)
        print("Loaded", p.name)
        print(df_titanic.head())
        break
else:
    # fallback: look for any csv with "titan" in the filename
    files = list(base.glob("*titan*.csv"))
    if files:
        df_titanic = pd.read_csv(files[0])
        print("Loaded", files[0].name)
        print(df_titanic.head())
    else:
        print("No Titanic CSV found in lab_assignment. Available CSV files:", [f.name for f in base.glob("*.csv")])

No Titanic CSV found in lab_assignment. Available CSV files: []

In [11]:
df_missing = pd.read_csv("titanic.csv")
df_missing

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [10]:
import pandas as pd
from pathlib import Path

base = Path(r"c:\Users\mint0\OneDrive\เดสก์ท็อป\lab_assignment")
candidates = ["titanic.csv", "titanic_data.csv", "Titanic.csv", "train.csv", "titanic_train.csv"]

csv_path = next((base / f for f in candidates if (base / f).exists()), None)
if csv_path is None:
    files = list(base.glob("*titan*.csv")) + list(base.glob("*titanic*.csv"))
    csv_path = files[0] if files else None

if csv_path is None:
    print("Titanic CSV not found in", base)
    print("Available CSV files:", [p.name for p in base.glob("*.csv")])
else:
    df_titanic = pd.read_csv(csv_path)
    print("Loaded:", csv_path.name)
    print("shape:", df_titanic.shape)
    print("columns:", df_titanic.columns.tolist())
    display(df_titanic.head())

Loaded: titanic.csv
shape: (418, 11)
columns: ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [12]:

df_titanic.rename(columns={"Name": "Passenger_Name", "Ticket": "Ticket_Num"}, inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [13]:
df_titanic.set_index("PassengerId", inplace=True)
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [14]:
key = 896
col = "Passenger_Name" if "Passenger_Name" in df_titanic.columns else "Name"
if key in df_titanic.index:
    print(df_titanic.loc[key, col])
elif str(key) in df_titanic.index:
    print(df_titanic.loc[str(key), col])
else:
    print(f"PassengerId {key} not found in df_titanic.index")

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [15]:
df_titanic.reset_index(inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [16]:
num_missing_age = df_titanic["Age"].isnull().sum()
print("num_missing_age:", num_missing_age)

num_missing_age: 86

Compute the avg age of passengers ignoring the missing data.

In [17]:
df_titanic.dropna(how='all')
means = df_titanic[["Age"]].mean()
avg_age = means["Age"]

print("avg_age:", avg_age)

#avg_age = df_data["Age"].mean()

avg_age: 30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [18]:
#Write your code here
#df_titanic.isnull()
#df_titanic = pd.read_csv("titanic.csv", na_values=["NaN", "not available"])
#df_titanic.head()
#df_titanic.fillna(0)
df_titanic.fillna({"Age":0})

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,0.0,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,0.0,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,0.0,1,1,2668,22.3583,NaN,C

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [19]:

top5_oldest = df_titanic.sort_values(by='Age', ascending=False)['Age'].head(5)

print("Top 5 oldest:")
print(top5_oldest)


top5_oldest = top5_oldest.reset_index(drop=True)

#average_age = top5_oldest.loc[:4, 'Age'].mean()
average_age = top5_oldest.mean()
print(f"The average age of the 5 oldest passengers is: {average_age}")

Top 5 oldest:
96     76.0
81     67.0
236    64.0
179    64.0
305    64.0
Name: Age, dtype: float64
The average age of the 5 oldest passengers is: 67.0